#pragma once
#include "struct_common.h"
/*********
*检测lightflag说明
*0代表同种颜色的灯
*1 红->黄
*2 红->绿
*3 黄->红
*4 黄->绿
*5 绿->红
*6 绿->黄
**********/

/******************************************************
*算法使用：在原始行车记录仪的图片上裁剪出(大于等于1920*1080)960*640,(1280*720)640*420的区域
*1920*1080（取左上（w/2-480,h/2-280）,右下（w/2+480,h/2-360)区域）
*1280*720(取左上（w/2-320,h/2-240）,右下（w/2+320,h/2+180)区域）
*然后再进行缩放到320*320大小
*******************************************************/

namespace trafficlight {
	/***********************************************
	*功能    sdk初始化环境，创建实例
	*handle  输入句柄
	***********************************************/
	int TrafficLightInit(long long* handle);
	/*********************************************
	*功能   交通信号灯检测
	*handle 输入参数
	*imagedata  输入参数,图像数据
	*width      输入参数 图像的高
	*height     输入参数 图像的宽
	*channel    输入参数 图像的通道
	*Detectbox  输出参数 图像的检测的框
	*count      输出参数 检测框的个数
	*lightflag  输出参数 信号灯变化状态
	*count1     输出参数 信号灯变化状态的个数
	********************************************/
	int TrafficLightDetect(long long handle,const unsigned char* imagedata,int width,int height,int channel,Detectbox** detectout,int* count);
	/********************************************
	*功能    清理sdk环境
	*输入    句柄
	*********************************************/
	int TrafficLightCleanUp(long long handle);
}
